<template>
  <div id="home">
    <div class="public cl">
      <div class="info_set">
        <div class="line"></div>
        <p class="p_title">6789直播条款</p>
        <el-button class="backbtn" @click="goback()">返回</el-button>
        <div class="text">
          <h4>
            本协议由您与6789直播平台应用程序（以下简称"6789平台"或“本平台”
            ）共同缔结，本协议具有合同效力。在下载6789平台和/或使用6789平台之前，请先仔细阅读本《6789平台用户协议》，特别是字体加粗、颜色标记的内容
          </h4>

          <p>
            本平台根据以下服务条款为您提供服务。本平台有权根据需要不时地制订、修改本协议及/或任何有关规则，并同意按照本协议的规定以及不时发布的操作规则提供基于互联网以及移动网的相关服务（以下称"网络服务"）变更后的协议和有关规则经网站公布后，在公告明确的特定时间自动生效。前述所有的指引和规则，均构成本使用协议的一部分。您在使用本平台提供的各项服务之前，应仔细阅读本使用协议。如您不同意本使用协议及/或随时对其的修改，请您立即停止使用6789平台应用程序所提供的全部服务；您一旦使用，即视为您已了解并完全同意本使用协议各项内容，包括本平台对使用协议随时所做的任何修改。此后，您不得以未阅读本使用协议内容作任何形式的抗辩。
          </p>

          <h5>1.服务说明</h5>

          <p>
            1.1
            为了您能使用本平台提供的服务，您同意以下事项：依本服务注册提示，请您填写正确的用户名，注册手机号码/邮箱和密码，并确保今后更新的邮箱、名号、手机号码等资料的有效性和合法性。若您提供任何违法、不道德或本平台认为不适合在6789平台上展示的资料，或者本平台有理由怀疑您的资料属于程序或恶意操作，本平台有权暂停或终止您的账号，并拒绝您于现在和未来使用本服务之全部或任何部分。
          </p>
          <p>
            1.2
            您点击“接受”或“同意”按钮并按注册程序成功注册后，您的行为就已表示您无条件接受并遵守本使用条款以及本平台不时公布的各项“其他公开规则”，包括但不限于：《用户条例》以及其他官方通知。
          </p>
          <p>
            1.3
            注册成功后，本平台将给予您一个帐号及相应的密码，该用户帐号和密码由用户负责保管，保护您的账号安全，是您的责任。您应对所有使用您的密码及账号的活动负完全的责任。您同意：1）如果您未保管好自己的账号和密码，因此而产生的任何损失或损害，本平台无法也不承担任何责任；2）您要对您账号中的所有活动和事件负全责。如果您未保管好自己的账号和密码而对您、本平台或第三方造成的损害，您将负全部责任。
          </p>
          <p>
            1.4
            本平台采取合理的方式提请用户注意的义务将通过如下方式实现：在本协议中以明确的足以引起您注意的加重字体颜色标记等合理方式提醒用户注意相关条款（需要强调的是，还包括您应特别注意任何未明确标记的含有“不承担”、“免责”“不得”等形式用语的条款），该等条款的确认将导致您在特定情况下的被动、
            不便、损失，请您在确认同意本协议之前再次阅读上述条款。双方确认上述条款非属于《合同法》第40条规定的“免除其责任、加重对方责任、排除对方主要权利的”的条款。鉴于本平台已依法明确了上述条款、履行了格式条款制订方的义务，您点击“同意”或“下一步”，将被视为且应当被视为您已经完全注意并同意了本协议所有条款。您不应当以本平台未对格式条款以合理方式提醒您注意，或未根据您要求尽到说明义务为理由而声称或要求法院或其它任何第三方确认相关条款非法或无效。
          </p>
          <p>
            1.5
            如有任何需要说明条款的要求，请您立即停止使用该平台服务，若您未致电或发送有说明条款要求的邮件至本平台而选择同意该协议，则双方在此确认本平台已依法履行了根据您要求对相关条款进行说明的法定义务，本平台已给予您充足的时间与充分的选择权来决定是否缔结本协议。
          </p>

          <h5>2.服务内容</h5>

          <p>
            2.1
            本平台服务的具体内容由6789根据实际情况提供，包括但不仅限于6789平台、论坛(BBS)、聊天室、电子邮件、发表新闻评论等。
          </p>
          <p>
            2.2
            本平台提供的部分网络服务为收费的网络服务，若您使用收费网络服务则需要向本平台支付一定的服务费用。对于收费的网络服务，本平台会在您使用之前给予您明确的提示，只有您根据提示确认并愿意支付相关费用，才能使用该收费网络服务。若拒绝支付相关费用，则不可享受该收费网络服务。
          </p>
          <p>
            2.3
            您同意并理解，本平台仅提供相关的网络服务，除此之外与相关网络服务有关的设备（如个人电脑、手机、及其他与接入互联网或移动网有关的装置）及所需的费用（如为接入
            互联网而支付的电话费及上网费、为使用移动网而支付的手机费）均应由您自行负担。
          </p>

          <h5>3.使用规则</h5>

          <p>
            3.1
            用户承诺以其真实身份注册成为本平台的用户，并保证所提供的个人资料信息真实、完整、有效，并依据法律规定和必备条款约定对所提供的信息承担相应的法律责任。用户以其真实身份注册成为本平台用户后，需要修改所提供的个人身份资料信息的，6789应当及时、有效地为其提供该项服务。
          </p>
          <p>
            3.2
            本平台有权审查用户注册所提供的身份信息是否真实、有效，并应积极地采取技术与管理等合理措施保障用户账号的安全、有效；用户有义务妥善保管其账号及密码，并正确、安全地使用其账号及密码。
          </p>
          <p>3.3 用户对登录后所持账号产生的行为依法享有权利和承担责任。</p>
          <p>
            3.4
            用户发现其账号或密码被他人非法使用或有使用异常的情况的，应及时根据本平台公布的处理方式通知本平台。本平台根据用户的通知采取措施暂停用户账号的登录和使用的，本平台应当要求用户提供并核实与其注册身份信息相一致的个人有效身份信息。6789核实用户所提供的个人有效身份信息与所注册的身份信息相一致的，应当及时采取措施暂停用户该账号的登录和使用。用户没有提供其个人有效身份证件或者用户提供的个人有效身份证件与所注册的身份信息不一致的，6789有权拒绝用户上述请求。
          </p>
          <p>
            3.5
            用户不应将其帐号、密码转让或出借予他人使用。如用户发现其帐号遭他人非法使用，应立即通知本平台。因黑客行为或用户的保管疏忽导致帐号、密码遭他人非法使用，本平台不承担任何责任。
          </p>
          <p>
            3.7
            用户同意接受本平台通过电子邮件或其他方式向用户发送商品促销或其他相关商业信息。
          </p>
          <p>
            3.8
            用户对于其创作并通过本平台服务上传到本平台网站上的内容依法享有版权及其他相关合法权利。对于用户通过本平台服务上传到6789网站上可公开获取区域的任何内容，用户同意本平台在全世界范围内具有免费的、永久性的、不可撤销的权利和许可，以使用、复制、修改、翻译、据以创作衍生作品、
            传播、表演和展示此等内容（整体或部分）。
          </p>
          <p>
            3.9
            如用户在使用网络服务时违反任何上述规定，本平台或其授权的人有权要求用户改正或直接采取一切必要的措施（包括但不限于更改或删除用户张贴的内容等、暂停或终止用户使用网络服务的权利）以减轻用户不当行为造成的影响。
          </p>
          <p>
            3.10
            本平台针对某些特定的服务的使用通过各种方式（包括但不限于网页公告、电子邮件、短信提醒等）做出的任何声明、通知、警示等内容视为本协议的一部分，用户如使用该服务，视为用户同意该等声明、通知、警示的内容。
          </p>
          <p>
            3.11
            用户输入的姓名和身份证号码结合与之对应的证件，作为6789用户的唯一有效身份证明；在无法有效证明其身份时，6789有权拒绝提供任何信息或承担任何义务。
          </p>
          <p>
            3.12
            您通过服务对程序的使用受制于某些已经包含在规则中的行为准则。这些规则将在本平台官方网站公开并不定期更新，所有通过服务使用程序的用户必须遵守。您有义务知晓、了解并遵守这些行为规则。本平台保留权利决定何种行为违反游戏精神，并对该等行为采取其认为合适的相应的处理措施（包括但不限于警告、倒扣数值、暂时或永久冻结账号、拒绝提供服务等）。本平台保留随时修改这些行为规则的权利。
          </p>
          <p>
            3.13本平台有权随时修改本协议的任何条款，一旦本协议的内容发生变动，本平台将会在相关的页面上提示修改内容。修改后的服务协议一旦在页面上公布即有效代替原来的服务协议。用户可随时造访https://www.6789.com查阅最新用户协议。
          </p>

          <h5>4.用户行为</h5>

          <h6>您在使用6789平台时，必须遵循以下规则：</h6>

          <p>4.1 遵守中国有关的法律和法规；</p>
          <p>4.2 遵守所有与网络服务有关的网络协议、规定和程序；</p>
          <p>4.3 不得为任何非法目的而使用6789平台；</p>
          <p>4.4 不得以任何形式使用6789平台下服务侵犯本平台的商业利益；</p>
          <p>
            4.5
            不得利用6789平台下服务系统进行任何可能对互联网或移动网正常运转造成不利影响的行为；
          </p>
          <p>
            4.6
            不得利用6789平台下提供的网络服务上传、展示或传播任何虚假的、骚扰性的、中伤他人的、辱骂性的、恐吓性的、庸俗淫秽的或其他任何非法的信息资料；
          </p>
          <p>
            4.7
            不得利用6789平台下服务系统进行任何不利于6789平台下的行为；6789平台有权对用户使用6789平台下服务的情况进行审查和监督，如用户在使用网络服务时违反任何上述规定，6789平台下或其授权的人有权要求用户改正或直接采取一切必要的措施以减轻用户不当行为造成的影响。
          </p>

          <h5>5.服务变更、中断或终止</h5>

          <p>
            5.1
            鉴于网络服务的特殊性，您同意本平台有权随时变更、中断或终止部分或全部的网络服务（包括收费网络服务）。如变更、中断或终止的网络服务属于免费网络服务，本平台无需通知，也无需对任何用户或任何第三方承担任何责任；如变更、中断或终止的网络服务属于收费网络服务，6789应当在变更、中断或终止之前事先通知用户，并应向受影响的用户提供等值的替代性的收费网络服务，如用户不愿意接受替代性的收费网络服务，就该用户已经向本平台支付的服务费，本平台应当按照该用户实际使用相应收费网络服务的情况扣除相应服务费之后，将剩余的服务费退还给该用户。
          </p>

          <p>
            5.2
            用户理解，6789本平台需要定期或不定期地对提供网络服务的平台（如互联网网站、移动网络等）或相关的设备进行检修或者维护，如因此类情况而造成收费网络服务在合理时间内的中断，本平台无需为此承担任何责任，但6789本平台将尽可能事先进行通告。
          </p>

          <p>
            5.3
            本平台服务的各个新版本，本平台可以自行决定保留为本平台服务增加附加特点和功能，或者提供程序编程之修补、更新和升级的权利。本平台无需向您发出通知即可自行决定修改、停止或暂停您对任何版本本平台服务的使用，以便对相关技术
            进行检修、改良和/或升级，或者出于其他合理原因；对于由发行和/或不发行本平台服务的新版本而导致的直接或间接损害，本平台将不承担任何赔偿责任。
          </p>

          <p>
            5.4
            用户有如下任何一种或多种行为的，本平台有权随时取消该用户账号或终止或暂停对该用户的全部或部分服务（包括但不限于封停该用户帐号），并且有权随时取消或收回用户在游戏内获取的任何利益，而无需对用户或任何第三方承担任何责任：
          </p>

          <p class="child">5.4.1 用户提供的个人资料不真实；</p>

          <p class="child">
            5.4.2
            用户违反本协议中规定的使用规则或者其他各项公开规则（《封号规则》、《隐私政策》、《社区平台使用协议》以及其他官方通知）的行为；
          </p>

          <p class="child">
            5.4.3 用户在使用收费网络服务时未按规定向本平台付相应的服务费；
          </p>

          <p class="child">
            5.4.4
            用户注册的帐号自注册起30天内或连续180天，没有使用过该帐号（包括使用该帐号登录游戏、登录网站、充值），则本平台有权删除该帐号，包括但不限于注册信息、等级信息、物品信息等一切与该注册帐号相关的信息；
          </p>

          <p>
            5.5
            用户有发布违法信息、严重违背社会公德、以及其他违反法律禁止性规定的行为，本平台应当立即终止对用户提供服务。
          </p>

          <p>
            5.6
            用户在接受本平台服务时实施不正当行为的，本平台有权终止对用户提供的服务。该不正当行为的具体情形应当在本协议中有明确约定或属于本平台事先明确告知的应被终止服务的禁止性行为，否则，本平台不得终止对用户提供服务。
          </p>

          <p>
            5.7
            用户提供虚假注册身份信息，或实施违反本协议的行为，本平台有权中止对用户提供全部或部分服务；本平台采取中止措施应当通知用户并告知中止期间，中止期间应该是合理的，中止期间届满本平台应当及时恢复对乙方的服务。
          </p>

          <p>
            5.8
            用户若反对任何服务条款的建议或对后来的条款修改有异议，或对本站服务不满，用户只有以下的追索权：
          </p>

          <p class="child">5.8.1不再使用本站服务。</p>

          <p class="child">5.8.2结束用户使用本站服务的资格。</p>

          <p class="child">5.8.3通告本站停止该用户的服务。</p>

          <h6>
            结束用户服务后，用户使用本站服务的权利马上中止。从那时起，本站不再对用户承担任何义务。
          </h6>

          <p>
            5.9
            用户应确实遵守本协议条款及有关法律命令的规定。本平台对于用户是否违反本协议条款有最终解释权。若本平台认定用户违反协议条款或任何法令者，用户同意本平台可以随时终止其帐号的使用。
          </p>

          <h5>6.知识产权条款</h5>

          <p>
            6.1
            本平台提供的网络服务中包含的任何文本、图片、图形、音频和/或视频资料均受版权、商标和/或其它财产所有权法律的保护，未经本平台或相关权利人同意，上述资料均不得在任何媒体直接或间接发布、播放、出于播放或发布目的而改写或再发行，或者被用于其他任何商业目的。否则，本平台有权追究其法律责任。本平台不就由上述资料产生或在传送或递交全部或部分上述资料过程中产生的延误、不准确、错误和遗漏或从中产生或由此产生的任何损害赔偿，以任何形式，向用户或任何第三方负责。
          </p>

          <p>
            6.2
            本平台为提供网络服务而使用的任何软件（包括但不限于软件中所含的任何图象、照片、动画、录像、录音、音乐、文字和附加程序、随附的帮助材料）的一切权利均属于该软件的著作权人，未经该软件的著作权人许可，用户不得对该软件进行反向工程（reverse
            engineer）、反向编译（decompile）或反汇编（disassemble）。
          </p>

          <h5>7.用户隐私保护政策</h5>

          <p>
            7.1
            用户知悉并同意，为便于向用户提供更好的服务，在用户使用本平台服务时，服务器会自动记录一些信息，包括但不限于URL、IP地址、浏览器类型、使用语言、访问日期和时间等。
          </p>

          <p>
            7.2
            保护用户隐私是本平台的一项基本政策，未经用户许可本平台不得向任何第三方提供、公开或共享用户注册资料中的姓名、个人有效身份证件号码、联系方式等个人身份信息，但下列情况除外：
          </p>

          <p class="child">7.2.1 用户或用户监护人授权甲方披露的；</p>

          <p class="child">7.2.2 有关法律要求本平台披露的；</p>

          <p class="child">
            7.2.3 司法机关或行政机关基于法定程序要求本平台提供的；
          </p>

          <p class="child">
            7.2.4 用户为了维护自己合法权益而向本平台提起诉讼或者仲裁时；
          </p>

          <p class="child">
            7.2.5 应用户监护人的合法要求而提供用户个人身份信息时；
          </p>

          <p class="child">7.2.6 为维护社会公众的利益的。</p>

          <p>
            7.3
            在不透露单个用户隐私资料的前提下，6789有权对整个用户数据库进行技术分析并对已进行分析、整理后的用户数据库进行商业上的利用。尽管6789对用户的隐私权保护做了极大的努力，但是仍然不能保证现有的安全技术措施使用户的技术信息等不受任何形式的损失。
          </p>

          <p>
            7.4
            为了向您提供服务，我们可能会收集有关服务性能、您的计算机和您的服务使用情况的特定信息。我们可能会自动从您的计算机中上载此信息。该数据不会标识您的个人身份。
          </p>

          <h5>8.免责声明</h5>

          <p>
            8.1
            用户明确同意其使用本平台服务所存在的风险将完全由其自己承担；因其使用本平台服务而产生的一切后果也由其自己承担，本平台对用户不承担任何责任。因用户擅自交易账号导致的纠纷，6789本平台不承担任何责任。
          </p>

          <p>
            8.2
            本平台不担保网络服务一定能满足用户的要求，也不担保网络服务不会中断，对网络服务的及时性、安全性、准确性也都不作担保。
          </p>

          <p>
            8.3
            本平台不保证为向用户提供便利而设置的外部链接的准确性和完整性，同时，对于该等外部链接指向的不由本平台实际控制的任何网页上的内容，本平台不承担任何责任。
          </p>

          <p>
            8.4
            对于因不可抗力或本平台不能控制的原因造成的网络服务中断或其它缺陷，本平台不承担任何责任，但将尽力减少因此而给用户造成的损失和影响。
          </p>

          <p>
            8.5
            用户同意，对于6789向用户提供的下列产品或者服务的质量缺陷本身及其引发的任何损失，本平台无需承担任何责任：
          </p>

          <p class="child">8.5.1 本平台向用户免费提供的各项网络服务；</p>

          <p class="child">8.5.2 本平台向用户赠送的任何产品或者服务；</p>

          <p class="child">
            8.5.3 本平台向收费网络服务用户附赠的各种产品或者服务。
          </p>

          <p>
            8.6
            针对本平台服务中免费供用户使用的部分。您承认并同意本平台、其关联方、其许可人及本平台员工无须承担由于您使用本平台服务中免费供用户使用的部分而产生或引发的任何责任。对于本平台服务中免费供用户使用的部分存在的任何问题或任何不满，您唯一的权利及补救措施就是立即卸载并停止使用本平台游戏平台及附带相关软件。
          </p>

          <p>
            8.7
            在任何情况下，即使本平台、其关联方或本平台员工事先知道下述损失的可能性，本平台、其关联方或本平台员工都无须在合同、保证、侵权（包括过失）、产品责任或其他任何形式的责任方面，为由于使用或无法使用本平台服务而产生的任何间接的、偶然的、特殊的或必然的损失（包括但不限于任何数据的损坏、服务的中断、计算机无法操作或金钱上的损失）负责。
          </p>

          <p>
            8.8
            在适用法律允许的最大范围内，本平台明确表示不提供任何其他类型的保证，不论是明示的或默示的，包括但不限于适销性、适用性、可靠性、准确性、完整性、无病毒以及无错误的任何默示保证和责任。
          </p>

          <h5>9.违约赔偿</h5>

          <p>
            9.1
            如因地网违反有关法律、法规或本协议项下的任何条款而给用户造成损失，地网同意承担由此造成的损害赔偿责任。
          </p>

          <p>
            9.2
            用户同意保障和维护本平台及其他用户的利益，如因用户违反有关法律、法规或本协议项下的任何条款而给本平台或任何其他第三人造成损失，用户同意承担由此造成的损害赔偿责任。
          </p>

          <h5>10.违约赔偿</h5>

          <p>
            10.1
            本协议项下本平台对于用户所有的通知均可通过网页公告、电子邮件、手机短信或常规的信件传送等方式进行；该等通知于发送之日视为已送达收件人。
          </p>

          <p>
            10.2
            用户对于本平台的通知应当通过本平台对外正式公布的通信地址、传真号码、电子邮件地址等联系信息进行送达。
          </p>

          <h5>11.法律适用、管辖与其他</h5>

          <p>
            11.1
            本协议之效力、解释、变更、执行与争议解决均适用中华人民共和国大陆地区法律，如无相关法律规定的，则应参照通用国际商业惯例和/或行业惯例。
          </p>

          <p>
            11.2
            本平台于用户过失或违约时放弃本协议规定的权利的，不得视为其对用户其他或以后同类之过失或违约行为弃权。
          </p>

          <p>
            11.3
            若您、本平台或第三方之间发生任何纠纷或争议，各方首先应友好协商解决；协商不成的，三方均同意将纠纷或争议提交被告所在地的人民法院管辖。
          </p>

          <p>
            11.4
            本协议条款无论因何种原因部分无效或不可执行，其余条款仍有效，对双方具有约束力。
          </p>
        </div>
      </div>
    </div>
    <div class="margin50">
      <Footer></Footer>
    </div>
  </div>
</template>

<script>
const Footer = () => import("../../components/footer/footer");
export default {
  methods: {
    goback() {
      this.$router.push("/");
    },
  },
  components: {
      Footer,
  },
};
</script>

<style lang="less" scoped>
#home {
  width: 100%;
  height: 100%;
  background-image: url("../../image/bj.jpg");
  background-repeat: no-repeat;
  background-size: 100%;
  position: fixed;
  top: 0;
  left: 0;
  overflow: scroll;
  .public {
    width: 100%;
    position: relative;
    margin-bottom: 40px;
    .info_set {
      width: 1273px;
      margin: auto;
      margin-top: 10px;
      // height: 800px;
      background-color: #fff;
      // padding: 13px 13px 0;
      padding-top: 13px;
      box-shadow: 0 3px 3px 3px #dbdbdb;
      border-top-left-radius: 5px;
      border-top-right-radius: 5px;
      box-sizing: border-box;
      .line {
        width: 200px;
        height: 2px;
        margin: auto;
        margin-top: 20px;
        margin-bottom: 10px;
        background-color: #309cfb;
        box-sizing: border-box;
      }
      .p_title {
        margin-left: 46px;
        border-left: 5px solid #014681;
        color: #014681;
        font-size: 18px;
        height: 20px;
        line-height: 20px;
        padding: 0 10px;
        font-weight: 600;
        position: relative;
      }
      .p_title:after {
        content: "";
        position: absolute;
        top: 50%;
        height: 1px;
        width: 900px;
        background-color: #d2d2d2;
        left: 150px;
      }
      .backbtn {
        position: absolute;
        top: 30px;
        right: 350px;
      }
    }
  }
}
.text {
  width: 1100px;
  margin: auto;
  padding-bottom: 50px;
  p {
    font-size: 16px;
    text-indent: 30px;
  }
  .child {
    text-indent: 60px;
  }
  h5 {
    margin: 10px;
  }
}
h4 {
  margin: 20px;
}
</style>